// JS3-4.for문연습1 JS

/*************************************************************************** 
 [프로그램 요구사항]
 1. 미니언즈 넣기
 (1) 미니언즈 버튼을 클릭하면 파란박으세 미니언즈 이미지가 추가되어 들어간다
 (2) 이때 미니언즈 버튼마다 한번에 들어가는 개수가 정해져있다(1개,5개,10개)
 < 대상 선정 >
 -> 이벤트 대상 : .mini (click이벤트) 
 -> 변경대상 : .Bcase
 
 ___________________________________________________________________________
 
 2. 미니언즈 개수 표시하기
 (1) 미니언즈 넣을 때 실시간 반영 개수를 표시한다
 (2) 이때 미니언즈 이미지가 3개씩 있으므로 3의 배수로 표시해준다
 < 대상 선정 >
 -> 이벤트 대상 : .mini (click이벤트) 
 -> 변경대상 : .stxt span
 
 ___________________________________________________________________________
 
 3. 파란박스 리셋하기
 (1) 리셋버튼을 클릭하면 파란박스의 미니언즈 이미지 모두가 삭제된다
 (2) 이 때 미니언즈 개수도 0으로 초기화한다
 < 대상 선정 >
 -> 이벤트 대상 : .rbtn (click이벤트) 
 -> 변경대상 : .Bcase
 
***************************************************************************/


